var shenShaUtil = {
  SHEN_SHA_DATA: [
    {
      func: 'sanQi',
      title: '三奇贵人',
      desc: '三奇贵人，主人襟怀卓越，好奇尚大,博学多能，国家柱石。<br><br>但是，如果命局中有三奇贵人，也需要注意避免遇到伤官、气杀、劫财、刑冲破害等神煞。此外，如果三奇贵人落在空亡或死绝的地方，那么这个神煞的效力将会大大减弱，对命主的帮助也会大打折扣。<br><br>如果八字命局中出现三奇贵人，并且符合相应的条件，那么这将会是一个非常好的兆头，对命主的发展和成功将会有很大的助力。'
    },
    {
      func: 'tianYiGuiRen',
      title: '天乙贵人',
      desc: '天乙贵人是命中最吉之神，能够为人带来荣耀、功名和官禄。如果出现在四柱中，表示遇到困难时有人帮助，甚至能够逢凶化吉，解救危难。这是一个非常吉祥的神煞。<br><br>天乙贵人在命盘中的位置非常重要，它要能够遇到生旺，无冲破，道理顺的气，才能发挥最大的作用。而且，它最忌刑冲克害、空亡死绝之地。如果遇到这些情况，则可能带来不利的影响。总体而言，天乙贵人是一个非常强大的神煞，如果出现在命盘中，表示个人有极大的潜力，能够在事业、财运、地位等方面获得成功。但是，如果遇到不利的情况，还是要避重就轻，不要过度强调它的作用、而忽略其他因素。'
    },
    {
      func: 'kuiGang',
      title: '魁罡贵人',
      desc: '魁罡贵人，通常代表着个性刚烈、嫉恶如仇、喜欢见义勇为、有领导才能、聪明果断等特点。但是，如果是女性命中有魁罡贵人，则因为性格过于刚强，对婚姻可能有所影响。因此，魁罡贵人通常是男性喜见，女性则忌之。<br><br>魁罡贵人命格的主要特征是个性耿直,喜欢攻击性侵犯性，嫉恶如仇，杀伐果断，赏罚分明，有领导之威。魁罡贵人也喜欢掌握权力，做事果断，有时甚至会过于刚烈，容易招来风险或是恶人。魁罡贵人喜欢看到自己在事业或权力方面取得成功，这也是他们的特点之一。<br><br>他们的个性通常比较强势，对自己的目标有很强的坚持力,但有时也会太过执着，容易造成不必要的麻烦。<br><br>魁罡贵人的命格需要日主健旺，也即以财官为喜用，如果日主衰弱需要印生，否则不适合魁罡格命格。除此之外，命中若有刑冲兼破害等情况，容易导致身世贫困或遭受打击。因此，魁罡贵人的命格需要注意保持健康、积极发挥个人优势，并且寻找正确的发展方向。总的来说,若命主命格为魁罡格，则需要适当地发挥其聪明才智和领导才能,但也需要注意避免过度强硬或攻击性过强，否则可能会引发一些不必要的麻烦。<br><br>要适当地发挥其聪明才智和领导才能,但也需要注意避免过度强硬或攻击性过强，否则可能会引发一些不必要的麻烦。在配偶选择上，可以选择日干为日刃的男性或官杀星旺的男性，以减轻魁罡带来的不利影响。'
    },
    {
      func: 'guoYin',
      title: '国印贵人',
      desc: '国印贵人在命局中出现，则代表着拥有权力和掌控事务的能力。命带国印贵人的人，通常心地善良，为人和悦，做事严谨，遵守规则，办事公道，不会徇私舞弊。如果国印贵人能够逢生旺或有其他吉神相助，那么不仅可以有掌印之能，还可以在政府机关掌握实权。流运:国印贵人在流运中出现时，代表升职、提拔的机会。'
    },
    {
      func: 'taiJi',
      title: '太极贵人',
      desc: '太极贵人表着命主聪明好学、喜研究神秘文化、有钻劲、做事有始有终等特征。此外，太极贵人也喜爱天文、地理、哲学、佛道和宗教等方面的知识,并有着较高的悟性，对命理、玄学、术数等感兴趣。在命带多个太极贵人的情况下，其人容易有大成就，并且可能会成为人间富贵之人。'
    },
    {
      func: 'wenChang',
      title: '文昌',
      desc: '命中有文昌的人通常具有聪明才智和学术能力，且外表斯文优雅，性格谦虚。他们可能表现出对于艺术、文学和音乐的热情。此外，他们还可能对于探索新的领域和挑战自己的能力有着浓厚的兴趣。可以说，他们对生活充满了热情和好奇心。<br><br>命带文昌贵人的人，举止温顺文雅，才情出众，对学习、知识有着强烈的追求和执着。他们可能会花费大量的时间和精力来学习新的事物，并且对于知识的掌握和应用有着极高的要求。此外，他们还可能会参加各种研讨会和学术会议，以便与其他同行进行交流和学习。男性较注重内涵，女性则较注重外表。然而，无论男女，命中有文昌的人都会注重自己的形象和风度，并且具有出色的社交能力。他们擅长与人交流和沟通，并且能够在各种社交场合中游刃有余。<br><br>文昌常与考试学历、升职等名誉相关的方面有关。然而，命中有文昌的人不仅在学术和事业上表现出色，而且在家庭和个人生活中也可能会有着出色的表现。他们可能会运用自己的才智和智慧来解决各种问题，并且在家庭和社区中扮演重要的角色。'
    },
    {
      func: 'luShen',
      title: '禄神',
      desc: '禄神主要与财运相关，且在不同的位置上有不同的意义。若命盘中有禄神，则主享有好运、财源充沛、生活安稳、健康长寿等福利。但若禄神落在空亡或犯冲等不利位置，则主衣食不足、财运破灭等不利结果。'
    },
    {
      func: 'jinYu',
      title: '金舆',
      desc: '金舆代表着富贵和财富，并且可能带来名誉地位和艺术修养。命盘中有金舆的人，有机会得到财富和升迁，并享受豪华生活。此外，金舆在命局中也意味着可能得到祖荫或祖德的扶持，生活富裕无忧。女性逢之，主性格温柔善良，容貌美丽，生活富裕无忧﹔男性逢之，主得贤妻或受女性青睐，子孙康健。如果流年金舆为吉或者流年引发命局中金舆为吉，职场人士有升职加薪之喜。'
    },
    {
      func: 'tianDe',
      title: '天德',
      desc: '天德是一种象征天地德秀之气的吉祥物，据说具有化解灾厄的能力，能够将凶险化为吉祥。如果命中带有天德，那么你将会获得极大的福德，并且拥有善良的性格和健康的身体，享有良好的人缘。这种人在生活中较不容易遭遇横祸、盗难、灾劫等困难，即使遇到，也能适时得以化解。'
    },
    {
      func: 'tianDeHe',
      title: '天德合',
      desc: '天德合代表命主在人际关系和事业上容易得到他人的帮助和支持，进而提升个人的能力和智慧。如果应用得当，这个吉祥的组合可以带来很多好处。例如，在人际关系方面，命主会具备一种特殊的魅力，能够吸引到更多的朋友和支持者。在事业方面，命主也会比较容易得到上司和同事的认可，从而获得更多的机会和提升。在财运方面，命主也会比较顺利，因为他们能够更好地掌握商业机会和投资机会。总之，天德合是一个非常有利的组合，对于想要提升自己的能力和命运的人来说，是一个很好的选择。'
    },
    {
      func: 'yueDe',
      title: '月德',
      desc: '代表着命主能得到母亲或女性长辈的庇佑，有利于家庭和谐、情感和睦。而月德贵人更是命中的贵神之一，具有福禄寿命的象征，也代表着命主为人仁慈、待人诚恳、敏锐智慧,有着多方面的优秀天赋。月德贵人，不仅代表着个人在生活中将会受到很好的缘份与贵人帮助，而且也意味着个人的未来有着更加光明的发展前景。月德贵人的存在，让命主在事业发展上会有更多的成功机会，也有助于个人的身体健康，能够更容易地摆脱疾病或者恢复健康。总体而言，命中有日德贵人这样的贵神，是非容易地摆脱疾病或者恢复健康。总体而言，命中有月德贵人这样的贵神，是非常有利于个人的成长和发展的，因为这代表着命主天生就拥有多方面的优秀天赋和素质，能够在多个领域中脱颖而出，并且得到更多人的认可和帮助。'
    },
    {
      func: 'yueDeHe',
      title: '月德合',
      desc: '月德合的出现表示命主有着丰富的感性情感世界和敏锐的直觉能力，这使得命主更容易掌握和把握机遇。此外，月德合还代表着对家庭和谐以及人际关系的重视，命主能够轻易地维持良好的人际关系，并且懂得经营和维护家庭的和谐。值得一提的是，月德合也是一个强化其他神煞作用的神煞。比如，如果命主的八字中有贵人、天乙贵人等吉神煞，那么这些神煞的作用会更加明显和强大。同时，如果命主八字中有凶煞，如五鬼、劫煞等，月德合也可以起到缓和和化解其作用的作用。'
    },
    {
      func: 'jiangXing',
      title: '将星',
      desc: '将星代表权力和领导能力，具有组织领导、指挥才能和慑众之威。若命局中将星与吉神相助，则可获得贵人加持，对事业和官运都有正面影响。不过若与凶神煞相会，则可能会遇到意外伤害等负面情况，易因性格过于急躁而惹出祸端。因此，在面对将星这个神煞时，应该谨慎对待,不要因为过于急躁而做出不明智的举动，避免不必要的风险和危险。<br><br>'
    },
    {
      func: 'yiMa',
      title: '驿马',
      desc: '驿马代表动态、行动、交通等意涵。它是八字看学业、工作升职、名利发展等项目的一个好神煞。根据古籍的说明,驿马在命局中出现，可以带来达官贵人、丰收富足、升职加薪、发财致富、换大别墅等好运气。它是一个与名利相关的吉神煞。<br><br>古籍中也有提到一些需要注意的事情。例如，马星在命局中受冲，可能会导致人过于忙碌、出差频繁等情况;马星与孤神吊客、丧门相冲，则可能预示着离乡背井、漂泊不定的命运。此外，女性马星过多也可能代表身心不安、住处不稳的不利象征<br><br>驿马可以带来名利发展、升职加薪、发财致富等好运气。但人们也需要注意马星受冲、与孤神吊客、丧门相冲等情况，以及女性马星过多可能带来的不利影响。'
    },
    {
      func: 'huaGai',
      title: '华盖',
      desc: '命中有华盖之人通常具有多才多艺、聪明好学、喜好艺术、音乐、书法等方面的才华，拥有独特的见解和超群的才能，然而，也容易孤僻和清高，有时难以理解和捉摸。此外，华盖星主宗教、哲学等神秘学问。命带华盖之人偏爱干净整洁，有洁癖，也爱面子，不擅长商场上的交际。<br><br>八字命局中有华盖星的人多数内心善良、仁慈，不忍心伤害他人或生物，且在事业发展上通常比较平稳。<br><br>'
    },
    {
      func: 'xueTang',
      title: '学堂',
      desc: '学堂主要与个人的学习和教育有关，出现学堂的人通常会有比较好的学习能力和成绩，并且很有可能取得比较好的学业成就。因此，对于出现学堂的人来说，建议多花时间和精力在学习上，进一步提升自己的能力，并且要有志气，努力追求更高的成就。<br><br>   不过，需要注意如果学堂受到冲克的影响，可能会导致个人的学业和创作能力受到阻碍或困难。因此，在遇到相应的问题时，需要避重就轻，采取适当的措施来减轻或消除影响，进一步发挥自己的能力。'
    },
    {
      func: 'ciGuan',
      title: '词馆',
      desc: '词馆主要与个人的创作能力有关，出现词馆的人通常会有比较好的文学和创作能力，有可能成为一位优秀的作家或文学家。因此，对于出现词馆的人来说,建议多读书，涉猎各种文学作品，进一步提高自己的文学素养，并且积极参与创作活动，逐渐磨练自己的创作技巧。不过，需要注意如果词馆受到冲克的影响，可能会导致个人的学业和创作能力受到阻碍或困难。因此，在遇到相应的问题时，需要避重就轻，采取适当的措施来减轻或消除影响，进一步发挥自己<br><br>的能力。'
    },
    {
      func: 'xueShi',
      title: '学士',
      desc: '学士代表才华、学识和学术成就。具有学士神煞的人通常读书功课佳，有很高的学历，并且具备一定的研究心、好奇心、探索欲和背诵能力。此外，学士神煞还与模仿力、创作力、想像力和理解力等才能有关。有学士神煞的人通常会有较好的学习和创作表现，而且易于掌握知识和技能。'
    },
    {
      func: 'jinShen',
      title: '金神',
      desc: '金神和财运、财富、地位等有着密切的关联。如果金神在命盘中属吉神煞，这意味着命主的财运和财富会比较旺盛,有很好的发展前景。命主可以透过自己的努力和智慧来积累财富，创造更好的生活。<br><br>但如果金神在命盘中属凶神煞，就需要命主格外小心了。凶神煞的存在通常会对财运和财富造成不良影响，可能会带来财务上的压力和困难。此时，命主可以通过一些方法来化解金神的负面影响，例如适当的风水布局和改变生活习惯等。'
    },
    {
      func: 'fuXing',
      title: '福星',
      desc: '福星代表着命主一生福禄无缺、多福多寿、平安幸福，并且逢凶化吉。<br><br>需要注意的是，即使命中带有福星贵人，也不能盲目依赖命运，要努力工作、认真对待生活，才能更好地发挥福星的作用，为自己和家人带来幸福和福气。'
    },
    {
      func: 'liuXiuRi',
      title: '六秀日',
      desc: '六秀日代表文笔卓越,相貌俊秀，人缘好，学习力强，思考力强，属于静态艺术家，如作家、画家、书法家、词曲创作家等等。此外，六秀日代表着身体健康，精神状态稳定，可以更好地投入到工作和学习中。'
    },
    {
      func: 'shiLingRi',
      title: '十灵日',
      desc: '十灵日代表着命主聪明伶俐，学习能力强，喜爱追求精神上的提升和享受。然而，需要注意的是，有时候命主的命盘中的十灵日可能也会带来一些负面影响，例如，容易沉迷于艺术和文学等精神领域，而忽略了现实生活中的需要。此时，命主需要注意保持自己的平衡，不要偏激地追求自己喜爱的领域，而忽略了其他重要的事务。'
    },
    {
      func: 'jinShen2',
      title: '进神',
      desc: '八字带进神的人性格执着，确定目标后会勇往直前，很少退缩。而且无论男女，大都容貌俊美，气质不俗。进神在八字表着—种吉祥、贵气的象征，具体含义包括聪明才智、高贵气质、事业发展等等。进神出现在年柱或月柱，则表示其命格较为优越;如果进神出现在日柱或时柱，则表示其个性特质或事业发展具有较为突出的表现。'
    },
    {
      func: 'tianYi',
      title: '天医',
      desc: '八字命盘中出现时，可以代表一个人较少有疾病的发生，且对于从事医疗、医学研究、心理学等相关领域的工作有较强的优势。因此，若命盘中出现“天医”神煞，可以在日后的职业规划中考虑相关职业。但同时也要注意,“天医”并不是万能的，仍需注意保持良好的生活习惯和健康状态。'
    },
    {
      func: 'hongLuan',
      title: '红鸾',
      desc: '红鸾代表着桃花和浪漫爱情，对于婚姻、恋爱、感情等方面都有利。在命盘中有红鸾的人，表示具有姻缘，适合投入爱情，而且会有机会遇到真命天子/女神。红鸾神煞与其他神煞相结合，能够影响其发挥作用的强度，例如，和天喜结合可以带来婚姻中的喜事。因此，在红鸾出现的同时，需要注意其他神煞是否会对其产生干扰或影响。<br><br>在红鸾的影响下，个人的感情运势比较好，容易遇到自己喜欢的异性，但同时也有可能引起他人的妒忌或是惹来感情纠纷。因此，在感情方面需要注意适度的把握与处理，避免因过于冲动而做出后悔的决定。此外，命中红鸾的人在工作上也容易遇到缘份，有机会得到意想不到的机遇和提升。<br><br>红鸾是中国神话中的一种红色仙鸟，被认为是代表桃花和浪漫爱情的吉神煞。在八字命理中，红鸾代表着一个人的真爱，不论何时出现都代表好事和正缘。如果命盘中带有红鸾，这意味着姻缘到来，爱情运势旺盛，对婚姻、恋爱、感情等方面都十分有利。但需要注意的是，八字中的红鸾并非万能的，它只是暗示着机会的存在，实际的结果还需看个人的努力和缘分。'
    },
    {
      func: 'tianXi',
      title: '天喜',
      desc: '天喜代表着人生中的喜事，包括升官发财、结婚生育等。天喜桃花是指婚姻美满、甜蜜又吉利的桃花，对于结婚生育非常有利。除了婚姻之外，天喜也可以代表生活中的其他喜事，如加薪升职、升官发财等。如果在流年大运中遇到天喜，也有可能会发生一些让人开心的事情。'
    },
    {
      func: 'xianChi',
      title: '咸池',
      desc: '咸池主要影响一个人的情感、性欲、魅力和恋爱、婚姻生活等。命带咸池的人有同情心、爱风骚、多才艺、喜欢艺术。如果八字出现咸池，并且处于生旺之地，则主其人姿容俊美。<br><br>若命中出现咸池神煞且其他因素配合得当，对个人的桃花运会有帮助。'
    },
    {
      func: 'hongYan',
      title: '红艳',
      desc: '红艳主要针对女性而言，命带有红艳煞的女人通常相貌美丽，浪漫多情，异性缘旺，容易吸引其他异性追求，而且很容易动情接受对方，因此容易发生婚外恋，或婚前同居等事。<br><br>需要提醒的是,绝不能单凭命局中是否有红艳煞就断定一个人的人品和行为，因为八字命理学是复杂的，必须对整个命盘进行详细观察和审理，综合判断。<br><br>年柱:红艳出现于年柱,代表个人具有较强的魅力和吸引力，能够得到他人的青睐，尤其对于异性来说更具有吸引力。但同时也容易让个人过于注重外表和表面形象，而忽略内在修养。<br><br>和表面形象，而忽略内在修养。<br><br>月柱︰红艳出现于月柱，代表个人具有较强的社交能力和人际关系，能够得到他人的喜爱和信任，容易受到环境和他人的影响。但同时也容易变得过分注重别人的眼光，缺乏自我判断力。<br><br>日柱:红艳出现于日柱，代表个人具有较强的自信和个性魅力，容易得到他人的认同和支持。但同时也可能因为过度强调个人魅力而忽略了内在修养和内在价值。<br><br>时柱︰红艳出现于时柱，代表个人具有较强的表现欲和表现能力，容易在表演、演讲、表达等方面脱颖而出。但同时也容易因为过分注重表面形象而忽略了内在修养和内在价值。<br><br>流运:红艳出现于流运中，代表个人在该运程期间内会更具有吸引力和魅力，能够得到他人的关注和认同，容易得到一些机会和支持。但同时也需要注意不要过度依赖外在形象和表面功夫，要注重自我修养和内在价值。'
    },
    {
      func: 'guaJianSha',
      title: '挂剑煞',
      desc: '挂剑煞表示命主易受到尖锐物品的伤害，并且容易患上关节筋骨、胃肠、运动器官等疾病。因此，命主需要加强体育锻炼，保持良好的体魄，并注意避免金属、尖锐物品等对身体的伤害。'
    },
    {
      func: 'gouJiao',
      title: '勾绞',
      desc: '勾绞主要表现为牵连、羁绊、刑法等，容易导致口舌、刑狱等问题。勾绞特别容易导致口舌、刑狱等问题,而且对人的影响也较大。勾绞煞入命者，大多数具备心思敏捷的特点，主要掌握刑法之职或者是将帅，具有生杀大权。但若能克制自己的凶煞，能够掌握心路技巧,则能够克制煞气，化解其对自己的负面影响。'
    },
    {
      func: 'zaiSha',
      title: '灾煞',
      desc: '灾煞表示灾难、不祥之事。在命盘中出现，往往会带来种种不顺的事情，对职业和财富都有一定的影响。如果命局组合得当，灾煞有利于从事武职，例如公检法、军警等职业，并可能带来武权和财富。但如果命局组合不当，容易导致患病、遭受口舌是非、犯官非甚至牢狱之灾等负面影响，对求职和考试升学也不利。<br><br>其次，灾煞对个人的健康和安全也有影响。命局中出现灾煞，可能会导致身体不适、意外伤害或其他灾祸。因此，命主应该注意安全_避免公加冒险或高风险的活动，并严格遵守交通规则等相关法律法规。<br><br>流运:在流运中出现灾煞时，代表可能会面临一些灾难或意外事件，需要加强防范和保护，需要注意化解。'
    },
    {
      func: 'guChen',
      title: '孤辰',
      desc: '孤辰和寡宿代表着孤独、难以交际和不太容易得到支持的特质。它们在八字中的出现往往意味着命主会经历一些孤独和独立的经历，这也需要命主要特别注意自己的心理健康，并且要有坚定的信念和自信心去面对各种困难和挑战。命中有孤辰寡宿的人都有着独立的个性和思想，喜欢独自行动，不容易接近。在性格方面，这些人通常比较内向，不喜欢人际交往。这可能导致他们在社交方面缺乏技巧，难以与人打好关系。但是如果八字命局中有贵神相扶，则可以化解一些负面影响，甚至有可能成为领袖人物。<br><br>在婚姻方面，男性命中有孤辰，女性命中有寡宿，都意味着很难找到合适的伴侣。他们通常比较孤独，不愿意与人交往，也缺乏吸引异性的魅力。因此，他们在婚姻方面可能会遇到一些困难。但如果八字中还有其他适宜婚姻的神煞，例如天乙贵人等，则可能会改善这种情况。<br><br>年柱:孤辰寡宿出现在年柱上，这表示命主很可能是一个很独立的人，不太容易得到他人的支持和帮助。但是，这也意味着命主很有可能能够独立完成一些事情，而且会因此获得更多的成就感和自豪感。<br><br>月柱:孤辰寡宿出现在月柱上，这表示命主可能有着比较内向的性格，不太擅长与他人交流和沟通。但是，这也可以表明命主有着深厚的内心世界和丰富的内在生命力。<br><br>日柱︰孤辰寡宿出现在日柱上，这表示命主的个性可能较为孤僻和独立，不太容易与他人建立深厚的关系。但是，命主也可能因此拥有较高的自由度和控制力，并且能够独立面对生活中的各种挑战和困难。<br><br>时柱:孤辰寡宿出现在时柱上，这表示命主在个人职业生涯中可能面临着较大的挑战，需要更加独立地进行决策和行动。但是，同时也可能表明命主在职业生涯中有着较高的成就和独立性。<br><br>流运︰如果在流运中遇到孤辰、寡宿，则容易感到孤独、孤立，与他人的交流和互动不顺畅。此时应该注意调整自己的心态，主动和他人交流，寻找支持和帮助。'
    },
    {
      func: 'guaXiu',
      title: '寡宿',
      desc: '孤辰和寡宿代表着孤独、难以交际和不太容易得到支持的特质。它们在八字中的出现往往意味着命主会经历一些孤独和独立的经历，这也需要命主要特别注意自己的心理健康，并且要有坚定的信念和自信心去面对各种困难和挑战。命中有孤辰寡宿的人都有着独立的个性和思想，喜欢独自行动，不容易接近。在性格方面，这些人通常比较内向，不喜欢人际交往。这可能导致他们在社交方面缺乏技巧，难以与人打好关系。但是如果八字命局中有贵神相扶，则可以化解一些负面影响，甚至有可能成为领<br><br>在婚姻方面，男性命中有孤辰，女性命中有寡宿，都意味着很难找到合适的伴侣。他们通常比较孤独，不愿意与人交往，也缺乏吸引异性的魅力。因此，他们在婚姻方面可能会遇到一些困难。但如果八字中还有其他适宜婚姻的神煞，例如天乙贵人等，则可能会改善这种情况。<br><br>年柱:孤辰寡宿出现在年柱上，这表示命主很可能是一个很独立的人，不太容易得到他人的支持和帮助。但是，这也意味着命主很有可能能够独立完成一些事情，而且会因此获得更多的成就感和自豪感。<br><br>月柱:孤辰寡宿出现在月柱上，这表示命主可能有着比较内向的性格，不太擅长与他人交流和沟通。但是，这也可以表明命主有着深厚的内心世界和丰富的内在生命力。<br><br>日柱︰孤辰寡宿出现在日柱上，这表示命主的个性可能较为孤僻和独立，不太容易与他人建立深厚的关系。但是，命主也可能因此拥有较高的自由度和控制力，并且能够独立面对生活中的各种挑战和困难。<br><br>时柱:孤辰寡宿出现在时柱上，这表示命主在个人职业生涯中可能面临着较大<br><br>时柱:孤辰寡宿出现在时柱上，这表示命主在个人职业生涯中可能面临着较大的挑战，需要更加独立地进行决策和行动。但是，同时也可能表明命主在职业生涯中有着较高的成就和独立性。<br><br>流运:如果在流运中遇到孤辰、寡宿，则容易感到孤独、孤立，与他人的交流和互动不顺畅。此时应该注意调整自己的心态，主动和他人交流，寻找支持和帮助。'
    },
    {
      func: 'jieSha',
      title: '劫煞',
      desc: '劫通常代表着一些挑战和困难，可能涉及到事业、财务、感情、人际关系等方面的问题。<br><br>流运：如果劫煞在流运中出现，代表命主在这段时间可能会遭遇到一些突发事件或困难，需要更加警惕和准备应对。这可能涉及到事业、财务、感情、健康等方面的问题，需要命主在这段时间保持积极、理性、冷静的态度，避免因为情绪波动而做出不理智的决定。同时，命主也可以通过增强自身的能力和技能，来应对这些挑战和困难，进而实现自我提升和成长。'
    },
    {
      func: 'liuXia',
      title: '流霞',
      desc: '流霞也被称为“血煞”，代表着血光之灾，命中出现此煞，容易遭遇身体受损的灾难，如皮肉伤折等等。命流霞煞的人需要特别注意自身的安全，在不利的流年期间，小心谨慎，防止意外发生。'
    },
    {
      func: 'yangRen',
      title: '羊刃',
      desc: '羊刃主要与命主的血气、狠辣、负面情绪有关。<br><br>年柱︰在年柱上，羊刃代表着命主在成长历程中可能会遇到很多的困难和挫折，需要付出更多的努力和决心才能够克服这些困难。<br><br>月柱:在月柱上，羊刃代表着情绪和家庭生活，尤其是在感情方面容易产生矛盾和纷争。<br><br>日柱:在日柱上，羊刃代表着命主的身体健康问题。<br><br>时柱:在时柱上，羊刃代表着事业和财务，容易受到挫折和阻碍。<br><br>流运∶在流运上，羊刃也会随着时间的变化产生不同的影响。在初运和中运阶段，表着命主的身体健康问题，但在晚运阶段，命主会逐渐明白如何掌控自己的情绪和思想，进而化解羊刃带来的负面影响，转而为自己创造更好的未来。'
    },
    {
      func: 'wangShen',
      title: '亡神',
      desc: '亡神是指命中难以避免的灾祸和失去，因此，命中有亡神的人，容易因小事而招来灾祸，诸如小病、小意外等。<br><br>流运:亡神出现在流运中，意味着在该流运中，容易遭受灾害、疾病、经济困难等等。需要更加谨慎应对生活中的各种挑战，提高对环境变化的警惕。'
    },
    {
      func: 'feiRen',
      title: '飞刃',
      desc: '飞刃主要预测身体受到外伤和疾病等方面的不利影响。当飞刃出现在八字的月支和时支上时，表示该人的身体容易受到伤害，可能有各种血光之灾和破皮等身体不适问题。此外，飞刃还可能导致家庭和感情方面的烦恼和是非。<br><br>如果在八字中出现“飞刃”这个神煞，则需要格外注意自己的身体健康和安全,尽量避免参加危险的活动，保持警觉性，提高安全意识。如果在大运中出现，则需要多加留意自己的身体状况和行动，适当调整自己的生活和工作节奏，以减少自休上的风险和不安全因素。<br><br>当遇到飞刃这个神煞时，不需过度担忧和害怕，以免影响自己的情绪和生活。可以从身体健康、心理健康和环境安全等方面入手，透过健康生活方式、积极心态和注意事项等来降低飞刃带来的负面影响，提升自己的生活质量和命运运势。<br><br>'
    },
    {
      func: 'sangMen',
      title: '丧门',
      desc: '丧门代表着丧亡之事，主要作用于大运和流年。丧门在古代也被称为地猾、地丧或地雌，是一种不吉之神，主要代表孝服哭泣之事。由此可知，丧门在古代的含义与现代八字算命的定义可能略有不同。需要注意的是，丧门这个神煞不是用来预测自己的灾祸的，而是用来预测自己亲朋好友的，要特别注意亲人的身体健康，并避免参加太多葬礼或者住在阴气重的地方。'
    },
    {
      func: 'geJiao',
      title: '隔角',
      desc: '如果八字命盘中出现隔角,命主容易受到六亲缘薄的影响，也容易在做事、出外等方面遇到阻碍、困难、隔绝等情况，也容易引发口舌是非，甚至会发生官司诉讼、牢狱之灾等不幸遭遇。因此，命主在日常生活中应注意保持积极向上的心态，谨慎处事，避免引起不必要的纠纷，也要避免违法犯罪等行为，以免遭受不幸。'
    },
    {
      func: 'shiEDaBai',
      title: '十恶大败',
      desc: '十恶大败在命理学中是一个不太吉利的神煞，对人的生活和事业带来一些不利的影响。如果一个人的命盘中有十恶大败，那么他的性格通常是比较软弱、容易逃避现实的。此外，他可能会面临生活和事业上的困难和挫折，运气比较差，很难顺利达成目标。<br><br>然而，需要提醒的是，八字命理只是一种参考，并不代表命中注定，而且世事难料，也有很多人即使命盘中有十恶大败日，但仍能在事业和财运上取得成功。最重要的还是要勤奋努力，提升自己的能力和素质。'
    },
    {
      func: 'diaoKe',
      title: '吊客',
      desc: '吊客代表着即将发生吊丧之事。如果八字命盘中出现了吊客这个神煞，再加上八字组合不好，那么命主就很可能会发生灾祸和意外。而且在行运的时候遇到吊客，也需要格外留意，因为这表示此时命主可能会遭遇到不幸的事情，并且需要谨慎对待。'
    },
    {
      func: 'baiHu',
      title: '白虎',
      desc: '白虎煞主要用于预测身体伤害，白虎代表血光之灾、灾祸死亡和勇猛魄力。命中带有白虎煞的人容易受到身体伤害的影响，可能会遭遇牢狱之苦。另外如果命盘中的白虎煞被制伏，反而会转化为吉祥之煞，有助于人生的发展。<br><br>白虎煞出现在流年中的作用是最强的。如果命主在这个年份遇到白虎煞，则容易发生身体伤害。因此，需要格外谨慎对待,可以注意保护自己的身体健康,避免参与危险的活动和维持积极的生活态度。'
    },
    {
      func: 'bingFu',
      title: '病符',
      desc: '病符代表着疾病、病灾等不良因素。病符属于休废之气，五行属水，为灾病星。在命中出现病符，或行运中遇到病符，都代表着可能有疾病、病灾等不良因素发生。<br><br>流运:病符出现在流运中，代表在这个时期会容易受到身体方面的困扰，需要特别注意健康。'
    },
    {
      func: 'xueRen',
      title: '血刃',
      desc: '血刃主要代表“血光之灾”，对于带有血刃的人来说，容易遇到意外、开刀、住院等流血事件，且对尖锐物品如刀、剑等比平常人更敏感。因此，命中有血刃出现的人需要特别留意身体健康和安全，注意避免发生意外事件。八字身强又逢血刃，其人较易因意外事故等刑伤而见血光;八字身弱又逢血刃之人则较易因病灾开刀而见血光。<br><br>年柱:血刃出现在年柱时，代表个人的健康容易受到影响，有可能会出现手术、意外伤害等情况。需要特别注意身体健康，加强保健，避免受伤或出现疾病。<br><br>月柱:血刃出现在月柱时，代表着家庭生活容易出现纷争、纠纷等问题，可能会对婚姻、感情产生不利的影响。需要注意家庭关系，加强沟通，避免不必要的冲突。<br><br>日柱︰血刃出现在日柱时，代表个人容易遭受意外伤害、被攻击等，需要特别注意安全，加强自我保护。<br><br>时柱:血刃出现在时柱时，代表个人容易遭受金钱损失、事业失败等，需要特别注意财务状况，谨慎投资，避免财务风险。<br><br>流运︰血刃出现在流运中，代表着相关的问题在这个时期可能会更加严重，需要特别注意相关的问题，采取相应的措施化解风险。'
    },
    {
      func: 'yinChaYangCuo',
      title: '阴差阳错',
      desc: '阴阳差错意思是太过与不及、男女不和。这个神煞与婚姻相关，对于男女命运都会造成不良影响。<br><br>年柱:如果阴差阳错出现在年柱，可能会对个人的健康或家庭生活产生负面影响。这可能表现为身体不适、家庭纠纷或其他问题。<br><br>月柱:如果阴差阳错出现在月柱，可能会对个人的感情生活或事业发展产生负面影响。这可能表现为感情烦恼、职场困难或其他障碍。<br><br>日柱︰如果阴差阳错出现在日柱，可能会对个人的个性和人际关系产生负面影响。这可能表现为个性缺陷、社交困难或其他问题。<br><br>时柱︰如果阴差阳错出现在时柱，可能会对个人的财运或事业发展产生负面影响。这可能表现为经济困难、事业挫折或其他问题。<br><br>流运:如果阴差阳错出现在流运周期中，可能会对个人的生活或事业产生负面影响。如果流运周期中的其他神煞也不利，那么影响可能会更加明显。然而，如果流运周期中有其他吉神煞，那么<br><br>这些正面因素可能会缓解阴差阳错的负面影响。<br><br>因此，在面对阴差阳错这种神煞时，我们应该以积极的态度去应对困难和挑战，同时注重自身的修养和发展，提高自己的抗压能力和适应能力，以渡过这些困难时刻。'
    },
    {
      func: 'baZhuan',
      title: '八专',
      desc: '八专容易对感情婚姻产生负面影响，例如感情争端、婚姻不利、夫妻不睦等等。此外，八专还容易因为酒色而招来困扰、失败。<br><br>流运:在流运中出现八专，表示命主在该时期内容易有桃花纠葛，需要特别小心自己的感情生活。'
    },
    {
      func: 'jiuChou',
      title: '九丑',
      desc: '九丑入命，通常代表着情欲较重的性格，容易陷入感情纠葛中。其次，九丑入命的人容易引发不好的风评，往往因情感纠葛而导致名声受损，尤其是因为不为人知的事情而被张扬，甚至对薄公堂，声名狼藉。<br><br>年柱:年柱上的九丑代表着父母、家庭和家族。如果九丑出现在年柱，那么家庭关系可能不太和睦，有可能会发生争吵或不和谐的事情。另外，父母的身体健康也容易出现问题。<br><br>月柱:月柱上的九丑代表着性格和情感。如果九丑出现在月柱，那么这个人可能有着比较暴躁的性格，容易与人发生冲突。<br><br>日柱:日柱上的九丑代表着个人的能力和事业。如果九丑出现在日柱，那么这个人在事业上可能会遇到困难，容易遭受打击和挫折。<br><br>时柱︰时柱上的九丑代表着人际关系和社交能力。如果九丑出现在时柱，那么这个人可能容易和人产生摩擦和矛盾，尤其是与上级、长辈等关系可能会不太和谐。同时，这个人也容易遭受到小人<br><br>和谐。同时，这个人也容易遭受到小人的陷害和攻击。<br><br>流运:如果九丑出现在流运中，那么这个人可能会在相应的时间里面遇到更多的困难和挫折。'
    },
    {
      func: 'wuGui',
      title: '五鬼',
      desc: '五鬼主要涉及到破财、人口不安、疾病、小人和官非等事情。五鬼还有一个俗名叫穷煞。遇到五鬼空亡的情况，也就是俗称的穷煞，会导致人们经济状况困难，生活穷困潦倒。'
    },
    {
      func: 'tianZhuan',
      title: '天转',
      desc: '地转的出现通常代表一个过去的结束和一个新的开始，可能会有一些变动和调整，需要注意调整心态和应对变化。地转也有一些特殊的象征意义，比如代表家宅或住宅的转移，或是人际关系的转变。'
    },
    {
      func: 'diZhuan',
      title: '地转',
      desc: '在命理学中，天转煞往往代表一个人生的转摈点，包括婚姻、事业、财运等方面的变化。在吉祥的情况下，天转煞可以带来好的转折和机会，例如婚姻方面，天转煞可以代表着结婚或者遇到对的人﹔在事业方面，天转煞可以代表着新的职位或者新的项目等等。<br><br>但是，当天转煞出现在凶位时，就可能带来不好的影响，例如在婚姻方面，可能会出现感情不顺或婚姻危机;在事业方面，可能会出现工作不顺或者失业等等。因此，遇到天转煞时，需要特别注意自己的言行举止，并且及时调整自己的心态和行为方式。'
    },
    {
      func: 'tianShe',
      title: '天赦',
      desc: '天赦是一颗逢凶化吉的吉神煞，对于命局中有天赦的人来说，其命中会带有消灾解祸的力量，具有化解灾煞、化解凶煞、化解官非的作用，能够带来好运、平安和幸福，对人缘、财运、事业、健康和感情等方面都有助益。'
    },
    {
      func: 'siFei',
      title: '四废',
      desc: '四废代表着生命的不完整或是缺失，可能与健康、事业等方面有关。<br><br>命中带有此煞，主要表现为体弱多病,精力体能较差，意志力薄弱，做事容易半途而废，有始无终。<br><br>在现实生活中，命带四废的人虽然机遇不好，但如果其他因素较好，例如后天姓名等，也还有可能在社会上得到帮扶和新的机会，达成人生目标。只要有机会，都可以往有利方向改善。不过，如果命局中有多个凶煞或者其他不利因素，就需要提高警惕，避免不必要的风险。<br><br>果命局中有多个凶煞或者其他不利因素，就需要提高警惕，避免不必要的风险。<br><br>流运︰四废在流运中出现时，可能代表健康问题、事业和财运损失。'
    }
  ],
  shenShas: [], //神煞列表
  gz: {}, //需要计算的干支对象
  MAX_ZHU: 6,
  GAN: '甲乙丙丁戊己庚辛壬癸',
  ZHI: '子丑寅卯辰巳午未申酉戌亥',
  // /**
  //  * 1.德秀贵人
  //  */
  // deXiu: function () {
  //   // 德秀贵人
  //   // 寅午戌月，丙丁为德，戊癸为秀。申子辰月，壬癸戊己为德，丙辛甲己为秀。巳酉丑月，庚辛为德，乙庚为秀。亥卯未月，甲乙为德，丁壬为秀
  //   let Description = '德秀贵人'
  //   let month = this.gz.baziZhis[1]
  //   let tianGans = this.gz.baziGans.slice(0, 4)
  //   if ('寅午戌'.indexOf(month) != -1) {
  //     if (
  //       (tianGans.indexOf('丙') != -1 || tianGans.indexOf('丁') != -1) &&
  //       (tianGans.indexOf('戊') != -1 || tianGans.indexOf('癸') != -1)
  //     ) {
  //       '丙丁戊癸'.split('').map(i => {
  //         if (tianGans.indexOf(i) != -1) this.shenShas[tianGans.indexOf(i)].push(Description)
  //       })
  //     }
  //   }
  //   if ('申子辰'.indexOf(month) != -1) {
  //     if (
  //       (tianGans.indexOf('壬') != -1 || tianGans.indexOf('癸') != -1 || tianGans.indexOf('戊') != -1 || tianGans.indexOf('己') != -1) &&
  //       (tianGans.indexOf('丙') != -1 || tianGans.indexOf('辛') != -1 || tianGans.indexOf('甲') != -1 || tianGans.indexOf('己') != -1)
  //     ) {
  //       console.log(
  //         '申子辰',
  //         tianGans.indexOf('壬') != -1 || tianGans.indexOf('癸') != -1 || tianGans.indexOf('戊') != -1 || tianGans.indexOf('己') != -1,
  //         tianGans.indexOf('丙') != -1 || tianGans.indexOf('辛') != -1 || tianGans.indexOf('甲') != -1 || tianGans.indexOf('己') != -1
  //       )
  //       '壬癸戊己丙辛甲'.split('').map(i => {
  //         if (tianGans.indexOf(i) != -1) this.shenShas[tianGans.indexOf(i)].push(Description)
  //       })
  //     }
  //   }
  //   if ('巳酉丑'.indexOf(month) != -1) {
  //     if (
  //       (tianGans.indexOf('庚') != -1 || tianGans.indexOf('辛') != -1) &&
  //       (tianGans.indexOf('乙') != -1 || tianGans.indexOf('庚') != -1)
  //     ) {
  //       '庚辛乙'.split('').map(i => {
  //         if (tianGans.indexOf(i) != -1) this.shenShas[tianGans.indexOf(i)].push(Description)
  //       })
  //     }
  //   }
  //   if ('亥卯未'.indexOf(month) != -1) {
  //     if (
  //       (tianGans.indexOf('甲') != -1 || tianGans.indexOf('乙') != -1) &&
  //       (tianGans.indexOf('丁') != -1 || tianGans.indexOf('壬') != -1)
  //     ) {
  //       '甲乙丁壬'.split('').map(i => {
  //         if (tianGans.indexOf(i) != -1) this.shenShas[tianGans.indexOf(i)].push(Description)
  //       })
  //     }
  //   }
  // },
  /**
   * 1.三奇贵人
   */
  sanQi: function () {
    //  三奇贵人
    // 在八字的天干之中，只要顺序出现了乙、丙、丁；甲、戊、庚；壬、癸、辛这三组中其中的一组，那么就是我们的三奇贵人
    CHEATS = '乙丙丁,甲戊庚,壬癸辛,丁丙乙,庚戊甲,辛癸壬'
    let Description = '三奇贵人'
    CHEATS.split(',').map(zi => {
      if (this.gz.gans.slice(0, this.MAX_ZHU).join('').indexOf(zi) != -1) {
        this.shenShas[this.gz.gans.indexOf(zi[0])].push(Description)
      }
    })
  },
  /**
   * 2.天乙贵人
   */
  tianYiGuiRen: function () {
    // 天乙贵人 甲戊并牛羊, 乙己鼠猴乡, 丙丁猪鸡位, 壬癸兔蛇藏, 庚辛逢虎马, 此是贵人方. 查 法: 以日干起贵人, 地支见者为是
    CHEATS = '日,甲戊见丑未,乙己见申子,丙丁见亥酉,壬癸见卯巳,庚辛见午寅'
    let Description = '天乙贵人'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 3.魁罡贵人
   */
  kuiGang: function () {
    //  魁罡贵人 壬辰庚戌与庚辰, 戊戌魁罡四座神,不见财官刑煞并,身行旺地贵无伦. 查法: 日柱见者为是
    CHEATS = '日,壬见辰,庚见戌,庚见辰,戊见戌'
    let Description = '魁罡贵人'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 4.国印贵人
   */
  guoYin: function () {
    //  国印贵人 甲见戌, 乙见亥, 丙见丑, 丁见寅,戊见丑, 己见寅, 庚见辰, 辛见巳.壬见未, 癸见申
    CHEATS = '年日,甲见戌,乙见亥,丙见丑,丁见寅,戊见丑,己见寅,庚见辰,辛见巳,壬见未,癸见申'
    let Description = '国印贵人'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 5.太极贵人
   */
  taiJi: function () {
    // 太极贵人 甲乙生人子午中, 丙丁鸡兔定亨通,戊己两干临四季,庚辛寅亥禄丰隆,壬癸巳申偏喜美, 值此应当福气 钟,更须贵格来相扶,候封万户到三公.
    CHEATS = '年日,甲乙见子午,丙丁见酉卯,壬癸见申巳,庚辛见寅亥,戊己见丑辰未戌'
    let Description = '太极贵人'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 6.文昌
   */
  wenChang: function () {
    //  文昌贵人 甲乙巳午报君知, 丙戊申宫丁己鸡.庚猪辛鼠壬逢虎,癸人见卯入云梯. 查法: 以年干或日干为主, 凡四柱中地支所见者为是
    let Description = '文昌'
    CHEATS = '年日,甲见巳,乙见午,丙见申,丁见酉,戊见申,己见酉,庚见亥,辛见子,壬见寅,癸见卯'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 7.禄神
   */
  luShen: function () {
    // 禄神甲禄寅、乙禄卯、丙禄巳、丁禄午、戊禄巳；己禄午、庚禄申、辛禄酉、壬禄亥、癸禄子。计算方法：八字命局中，以日干查四支，见之者为是。如日干为甲，地支中有寅，则为有禄神。
    let Description = '禄神'
    CHEATS = '日,甲见寅,乙见卯,丙见巳,丁见午,戊见巳,己见午,庚见申,辛见酉,壬见亥,癸见子'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 8.金舆
   */
  jinYu: function () {
    //  金舆 1. 以年干或日干为主. 凡甲丙两干见寅或子, 乙癸两干见卯或丑, 戊干见申, 己干见未, 丁干见亥, 庚干见午, 辛干见巳, 壬干见辰是也.
    // 2.八字日干为甲的，若四柱的地支有辰则为有金舆贵人；日干为乙的金舆贵人是巳；日干为丙或者戊的金舆贵人是未；日干为丁或者己的金舆贵人是申；日干为庚的金舆贵人是戌；日干为辛的金舆贵人是亥；日干为壬的金舆贵人是丑；日干为癸的金舆贵人是寅。
    let Description = '金舆'
    CHEATS = '日,甲见辰,乙见巳,丙戊见未,丁己见申,庚见戌,辛见亥,壬见寅'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 9.天德
   */
  tianDe: function () {
    //  天德 正月生者见丁, 二月生者见申,三月生者见壬, 四月生者见辛,五月生者见亥, 六月生者见甲,七月生者 见癸, 八月生者见寅,九月生者见丙,十月生者见乙,十一月生者见巳, 十二月生者见庚. 凡四柱年月日时上见者为有天德贵人.
    CHEATS = '月,寅见丁,卯见申,辰见壬,巳见辛,午见亥,未见甲,申见癸,酉见寅,戌见丙,亥见乙,子见巳,丑见庚'
    let Description = '天德'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 10.天德合
   */
  tianDeHe: function () {
    // 天德合 如天德正月在丁，与壬合，如正月见壬，即是天德合。正月壬，二月已，三月丁，四月丙，五月寅，六月乙，七月戊，八月亥，九月辛，十月庚，十一月申，十二月乙
    // :正寅月见壬、二卯月见巳、三辰月见丁、四巳月见丙、五午月见寅、六未月见己、七申月见戊、八酉月见亥、九戌月见辛、十亥月见庚、十一子月见申、十二丑见乙”
    let Description = '天德合'
    CHEATS = '月,寅见壬,卯见巳,辰见丁,巳见丙,午见寅,未见己,申见戊,酉见亥,戌见辛,亥见庚,子见申,丑见乙'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 11.月德
   */
  yueDe: function () {
    // 月德 寅午戌月生者见丙, 申子辰月生者见壬,亥卯未月生者见甲,巳酉丑月生者见庚. 凡柱中年月日时干上见者为有月德贵人.
    CHEATS = '月,寅午戌见丙,申子辰见壬,亥卯未见甲,巳酉丑见庚'
    let Description = '月德'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 12.月德合
   */
  yueDeHe: function () {
    //  月德合 与月德贵人五合之干即是月德合。也是以月支来查四柱的天干的。月德合查法：寅午戌月在辛，申子辰月在丁，亥卯未月在己，巳酉丑月在乙。
    let Description = '月德合'
    let yueZhis = ['寅午戌', '申子辰', '亥卯未', '巳酉丑']
    let gans = ['辛', '丁', '己', '乙']

    yueZhis.map((yuezhi, idx) => {
      if (yuezhi.indexOf(this.gz.zhis[1]) != -1) {
        this.gz.gans.map((gan, index) => {
          if (gan == gans[idx]) {
            this.shenShas[index].push(Description)
          }
        })
      }
    })
  },
  /**
   * 13.将星
   */
  jiangXing: function () {
    // 将星 以八字中的年支日支为主， 查四柱中的其余各支， 寅午戌见午，巳酉丑见酉，申子辰见子，辛卯未见卯。
    //说法2： 子见子、丑见酉、寅见午、卯见卯、辰见子、巳见酉;午见午、未见卯、申见子、酉见酉、戌见午、亥见卯
    let Description = '将星'
    CHEATS = '子见子,丑见酉,寅见午,卯见卯,辰见子,巳见酉,午见午,未见卯,申见子,酉见酉,戌见午,亥见卯'
    this.generateZhiShenSha(Description, CHEATS, [this.gz.zhis[0], this.gz.zhis[2]])
  },
  /**
   * 14.驿马
   */
  yiMa: function () {
    // 驿马 以年支或日支为主。申子辰马在寅, 寅午戌马在申,巳酉丑马在亥, 亥卯未马在巳.
    let Description = '驿马'
    yearZhi = this.gz.baziZhis[0]
    dayZhi = this.gz.baziZhis[2]
    let sanHe = ['申子辰', '寅午戌', '巳酉丑', '亥卯未']
    let zi = ['寅', '申', '亥', '巳']
    sanHe.map((item, i) => {
      if (item.indexOf(yearZhi) != -1 || item.indexOf(dayZhi) != -1) {
        this.gz.zhis.map((zhi, index) => {
          if (zhi == zi[i]) {
            this.shenShas[index].push(Description)
          }
        })
      }
    })
  },
  /**
   * 15.华盖
   */
  huaGai: function () {
    // 华盖 寅午戌见戌, 亥卯未见未,申子辰见辰, 巳酉丑见丑. 以年支或日支不主, 凡四柱中所见者为有华盖星.
    Description = '华盖'
    CHEATS = '寅午戌见戌,亥卯未见未,申子辰见辰,巳酉丑见丑'
    this.generateZhiShenSha(Description, CHEATS, [this.gz.zhis[0], this.gz.zhis[2]])
  },
  /**
   * 16.学堂
   */
  xueTang: function () {
    // 学堂  甲见己亥, 乙见壬午, 丙见丙寅, 丁见丁酉, 戊见戊寅, 己见己酉, 庚见辛巳, 辛见甲子, 壬见甲申, 癸见乙卯. 以年日干, 查四柱干支.
    let Description = '学堂'
    CHEATS = '年日,甲见己亥,乙见壬午,丙见丙寅,丁见丁酉,戊见戊寅,己见己酉,庚见辛巳,辛见甲子,壬见甲申,癸见乙卯'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 17.词馆
   */
  ciGuan: function () {
    // 词馆 年干或日干为主，查其他三柱。词馆的查法口诀是：甲干见庚寅，乙干见辛卯；丙干见乙巳，丁干见戊午；戊干见丁巳，己干见庚午；庚干见壬申，辛干见癸酉；壬干见癸亥，癸干见壬戌。
    // 十三行 有误
    let Description = '词馆'
    this.generateGanZhiShenSha(Description, '甲见庚寅,乙见辛卯,丙见乙巳,丁见戊午,戊见丁巳,己见庚午,庚见壬申,辛见癸酉,壬见癸亥,癸见壬戌', [
      this.gz.gans[0],
      this.gz.gans[2]
    ])
  },
  /**
   * 18.学士
   */
  xueShi: function () {
    // TODO 学士
    let Description = '学士'
  },
  /**
   * 19.金神
   */
  jinShen: function () {
    // 金神 金神者乙丑、己巳、癸酉三组干支，日柱或者时柱见者即是。
    let Description = '金神'
    let ganZhis = '乙丑,己巳,癸酉'.split(',')
    if (ganZhis.indexOf(this.gz.ganZhis[2]) != -1) {
      this.shenShas[2].push(Description)
    }
    if (ganZhis.indexOf(this.gz.ganZhis[3]) != -1) {
      this.shenShas[3].push(Description)
    }
  },
  /**
   * 20.福星
   */
  fuXing: function () {
    // 福星 以年干或日干为主。凡甲丙两干见寅或子，乙癸两干见卯或丑，戊干见申，己干见未，丁干见亥，庚干见午，辛干见巳，壬干见辰是也
    CHEATS = '年日,甲丙见寅子,乙癸见卯丑,戊见申,己见未,丁见亥,庚见午,辛见巳,壬见辰'
    let Description = '福星'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 21.六秀日
   */
  liuXiuRi: function () {
    // 六秀日 丙午、丁未、戊子、戊午、己丑、己未日生者。
    let Description = '六秀日'
    let targetGanZhis = ['丙午', '丁未', '戊子', '戊午', '己丑', '己未']
    let dayGanZhi = this.gz.gans[2] + this.gz.zhis[2]
    if (targetGanZhis.indexOf(dayGanZhi) != -1) {
      this.shenShas[2].push(Description)
    }
  },
  /**
   * 22.十灵日
   */
  shiLingRi: function () {
    // 十灵日 甲申、乙酉、丙子、丁丑、戊午、己丑、庚寅、辛卯、壬午、癸未
    // 说法2：甲辰、乙亥、丙辰、丁酉、戊午、庚戌、庚寅、辛亥、壬寅、癸未
    let Description = '十灵日'
    let targetGanZhis = ['甲辰', '乙亥', '丙辰', '丁酉', '戊午', '庚戌', '庚寅', '辛亥', '壬寅', '癸未']
    let dayGanZhi = this.gz.gans[2] + this.gz.zhis[2]
    if (targetGanZhis.indexOf(dayGanZhi) != -1) {
      this.shenShas[2].push(Description)
    }
  },
  /**
   * 23.进神
   */
  jinShen2: function () {
    //  进神
    let Description = '进神'
    let targetGanZhis = ['甲子', '甲午', '已卯', '已酉']
    let dayGanZhi = this.gz.gans[2] + this.gz.zhis[2]
    if (targetGanZhis.indexOf(dayGanZhi) != -1) {
      this.shenShas[2].push(Description)
    }
  },
  /**
   * 24.天医
   */
  tianYi: function () {
    // 天医 正月生见丑，二月生见寅，三月生见卯，四月生见辰，五月生见巳，六月生见午，七月生见未，八月生见申，九月生见酉，十月生见戌，十一月生见亥，十二月生见子.查法：以月支查其它地支，见者为是。
    let Description = '天医'
    this.generateZhiShenSha(Description, '子见丑,丑见寅,寅见卯,卯见辰,辰见巳,巳见午,午见未,未见申,申见酉,酉见戌,戌见亥,亥见子', [
      this.gz.zhis[1]
    ])
  },
  /**
   * 25.红鸾
   */
  hongLuan: function () {
    // 0,3 1,2 2,1 3,0 4,11 5,10 6,9 7,8 8,7 9,6 10,5 11,4
    // 红鸾 子见卯、丑见寅、寅见丑、卯见子、辰见亥、巳见戌;午见酉、未见申、申见未、酉见午、戌见巳、亥见辰。
    let Description = '红鸾'
    this.generateZhiShenSha(Description, '子见卯,丑见寅,寅见丑,卯见子,辰见亥,巳见戌,午见酉,未见申,申见未,酉见午,戌见巳,亥见辰', [
      this.gz.zhis[0],
      this.gz.zhis[2]
    ])
  },
  /**
   * 26.天喜
   */
  tianXi: function () {
    // 0,9 1,8 2,7 3,6 4,5 5,4 6,3 7,2 8,1 9,0 10,11 11,10
    // 天喜 子见酉、丑见申、寅见未、卯见午、辰见巳、巳见辰；午见卯、未见寅、申见丑、酉见子、戌见亥、亥见戌。
    let Description = '天喜'
    this.generateZhiShenSha(Description, '子见酉,丑见申,寅见未,卯见午,辰见巳,巳见辰,午见卯,未见寅,申见丑,酉见子,戌见亥,亥见戌')
  },
  /**
   * 27.咸池
   */
  xianChi: function () {
    // 咸池 申子辰在酉，寅午戌在卯，巳酉丑在午，亥卯未在子。以年支或日支查其余的三支，见以上地支者就是带有咸池。
    let Description = '咸池'
    yearZhi = this.gz.baziZhis[0]
    dayZhi = this.gz.baziZhis[2]
    let sanHe = ['申子辰', '寅午戌', '巳酉丑', '亥卯未']
    let zi = ['酉', '卯', '午', '子']
    sanHe.map((item, i) => {
      if (item.indexOf(yearZhi) != -1 || item.indexOf(dayZhi) != -1) {
        this.gz.zhis.map((zhi, index) => {
          if (zhi == zi[i]) {
            this.shenShas[index].push(Description)
          }
        })
      }
    })
  },
  /**
   * 28.红艳
   */
  hongYan: function () {
    // 红艳 日干是甲，地支见午，便是命带红艳煞。同理，日干是乙者，地支见申;日干是丙，地支见寅;日干是丁，地支见未;日干是戊，地支见辰;日干是己，地支见辰;日干是庚，地支见戌;日干是辛，地支见酉;日干是壬，地支见子;日干是癸，地支见申。
    // 这里需要勘误
    let Description = '红艳'
    CHEATS = '年日,甲见午,乙见申,丙见寅,丁见未,戊见辰,己见辰,庚见戌,辛见酉,壬见子,癸见申'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 29.挂剑煞
   */
  guaJianSha: function () {
    // 挂剑煞 如果八字中带有申巳酉丑中的任何字，岁运柱构成巳酉丑申，就会有血光刀刃之灾，轻则伤残。如果再带有元辰、亡神、金神、白虎煞，凶兆更大。
    let Description = '挂剑煞'
    let baziZhis = this.gz.baziZhis
    if (baziZhis.indexOf('巳') != -1 && baziZhis.indexOf('酉') != -1 && baziZhis.indexOf('丑') != -1 && baziZhis.indexOf('申') != -1) {
      this.shenShas[2].push(Description)
    }
  },
  /**
   * 30.勾绞
   */
  gouJiao: function () {
    // TODO 勾绞
    // 　以年支查余三支，如甲子年生男，为阳男，以命前三位的卯为勾，命后三位的酉为绞。又如甲子年生女，为阳女，以命后三辰酉为勾，命前三辰卯为绞。
    // 　　阳男阴女勾：子见卯；丑见辰；寅见巳；卯见午；辰见未；巳见申；午见酉；未见戌；申见亥；酉见子；戌见丑；亥见寅。
    // 　　阴男阳女绞：子见卯；丑见辰；寅见巳；卯见午；辰见未；巳见申；午见酉；未见戌；申见亥；酉见子；戌见丑；亥见寅。

    // 　　阳男阴女绞：子见酉；丑见戌；寅见亥；卯见子；辰见丑；巳见寅；午见卯；未见辰；申见巳；酉见午；戌见未；亥见申。
    // 　　阴男阳女勾：子见酉；丑见戌；寅见亥；卯见子；辰见丑；巳见寅；午见卯；未见辰；申见巳；酉见午；戌见未；亥见申。

    let Description = '勾绞'
  },
  /**
   * 31.灾煞
   */
  zaiSha: function () {
    //  灾煞 申子辰见午, 亥卯未见酉, 寅午戌见子, 巳酉丑见卯.查法: 以年支为主, 四柱地支中见之者为是
    let Description = '灾煞'
    CHEATS = '申子辰见午,亥卯未见酉,寅午戌见子,巳酉丑见卯'
    this.generateZhiShenSha(Description, CHEATS)
  },
  /**
   * 32.孤辰
   */
  guChen: function () {
    //  孤辰  亥子丑人, 见寅为孤, 见戌为寡.寅卯辰人, 见巳为孤, 见丑为寡.巳午未人, 见申为孤, 见辰为寡.申酉戌人, 见亥为孤,见未为寡.
    let Description = '孤辰'
    CHEATS = '亥子丑见寅,寅卯辰见巳,巳午未见申,申酉戌见亥'
    this.generateZhiShenSha(Description, CHEATS)
  },
  /**
   * 33.寡宿
   */
  guaXiu: function () {
    // 寡宿  亥子丑人, 见寅为孤, 见戌为寡.寅卯辰人, 见巳为孤, 见丑为寡.巳午未人, 见申为孤, 见辰为寡.申酉戌人, 见亥为孤,见未为寡.
    let Description = '寡宿'
    CHEATS = '亥子丑见戌,寅卯辰见丑,巳午未见辰,申酉戌见未'
    this.generateZhiShenSha(Description, CHEATS)
  },
  /**
   * 34.劫煞
   */
  jieSha: function () {
    // 劫煞 以年支或者日支是亥卯未的情况下 申子辰见巳，亥卯未见申，寅午戌见亥，巳酉丑见寅
    let Description = '劫煞'
    CHEATS = '申子辰见巳,亥卯未见申,寅午戌见亥,巳酉丑见寅'
    this.generateZhiShenSha(Description, CHEATS, [this.gz.zhis[0], this.gz.zhis[2]])
  },
  /**
   * 35.流霞
   */
  liuXia: function () {
    // 流霞 甲日酉、乙日戌、丙日未、丁日申、戊日巳；己日午、庚日辰、辛日卯、壬日亥、癸日寅。 在四柱命局的八字当中，以日元来查四柱以下的地支，同组相见就是流霞了。
    let Description = '流霞'
    CHEATS = '日,甲见酉,乙见戌,丙见未,丁见申,戊见巳,己见午,庚见辰,辛见卯,壬见亥,癸见寅'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 36.羊刃
   */
  yangRen: function () {
    // 羊刃 甲羊刃在卯, 乙羊刃在寅, 丙戊羊刃在午, 丁己羊刃在巳,庚羊刃在酉, 辛羊刃在申, 壬 羊刃在子, 癸羊刃在亥
    let Description = '羊刃'
    CHEATS = '日,甲见卯,乙见寅,丙见午,丁见巳,己见巳,戊见午,庚见酉,辛见申,壬见子,癸见亥'
    this.generateShenSha(Description, CHEATS)
  },
  /**
   * 37.亡神
   */
  wangShen: function () {
    //  亡神 申子辰见亥;寅午戌见已;巳酉丑见申;亥卯未见寅，即为亡神。以日支、年支起(年支为主)，其他柱中见之为是。
    let Description = '亡神'
    CHEATS = '申子辰见亥,寅午戌见巳,巳酉丑见申,亥卯未见寅'
    this.generateZhiShenSha(Description, CHEATS, [this.gz.zhis[0], this.gz.zhis[2]])
  },
  /**
   * 38.飞刃
   */
  feiRen: function () {
    // TODO 飞刃
    let Description = '飞刃'
  },
  /**
   * 39.丧门
   */
  sangMen: function () {
    // 丧门 子见寅，丑见卯，寅见辰，卯见巳，辰见午，巳见未，午见申，未见酉，申见戌，酉见亥，戌见子，亥见丑。比如说，年支或日支是子，其他地支见寅，那就是命带丧门。
    let Description = '丧门'
    CHEATS = '子见寅,丑见卯,寅见辰,卯见巳,辰见午,巳见未,午见申,未见酉,申见戌,酉见亥,戌见子,亥见丑'
    this.generateZhiShenSha(Description, CHEATS, [this.gz.zhis[0], this.gz.zhis[2]])
  },
  /**
   * 40.隔角
   */
  geJiao: function () {
    // 隔角 还可以从日支与生时同时进行判断，日支与生时隔一位的人就是命带隔角。比如子日前面隔一位是寅字，丑日前面隔一位是卯，寅日前面隔一位是辰，也就是子日生人遇寅时，丑日生人遇卯时，寅日生遇辰时也是，剩下的就可以以此类推。
    //   ZHI: '子丑寅卯辰巳午未申酉戌亥',
    let Description = '隔角'
    let riZhiIdx = this.ZHI.indexOf(this.gz.zhis[2])
    let shiZhiIdx = this.ZHI.indexOf(this.gz.zhis[3])

    if ((shiZhiIdx == 11 && riZhiIdx == 1) || (shiZhiIdx == 10 && riZhiIdx == 0)) {
      this.shenShas[3].push(Description)
    }

    if ((shiZhiIdx == 1 && riZhiIdx == 11) || (shiZhiIdx == 2 && riZhiIdx == 10)) {
      this.shenShas[3].push(Description)
    }

    if (Math.abs(shiZhiIdx - riZhiIdx) == 2) {
      this.shenShas[3].push(Description)
    }
  },
  /**
   * 41.十恶大败
   */
  shiEDaBai: function () {
    //  十恶大败 甲辰日、乙巳日、丙申日、丁亥日、戊戌日；己丑日、庚辰日、辛巳日、壬申日、癸亥日。在四柱命局的八字当中，以日柱为主，只要上述天干地支同柱出现，即为“十恶大败”。
    let Description = '十恶大败'
    let targetGanZhis = ['甲辰', '乙巳', '丙申', '丁亥', '戊戌', '己丑', '庚辰', '辛巳', '壬申', '癸亥']
    let dayGanZhi = this.gz.gans[2] + this.gz.zhis[2]
    if (targetGanZhis.indexOf(dayGanZhi) != -1) {
      this.shenShas[2].push(Description)
    }
  },
  /**
   * 42.吊客
   */
  diaoKe: function () {
    //  吊客 子见戌，丑见亥，寅见子，卯见丑，辰见寅，巳见卯，午见辰，未见巳，申见午，  酉见未，戌见申，亥见酉。比如说年支或日支是丑，其余地支有亥，就是命带吊客。
    let Description = '吊客'
    CHEATS = '子见戌,丑见亥,寅见子,卯见丑,辰见寅,巳见卯,午见辰,未见巳,申见午,酉见未,戌见申,亥见酉'
    this.generateZhiShenSha(Description, CHEATS, [this.gz.zhis[0], this.gz.zhis[2]])
  },
  /**
   * 43.白虎
   */
  baiHu: function () {
    // 白虎 “寅午戌见子，申子辰见午。亥卯未见酉，巳酉丑见卯。”具体来说就是白虎煞的查法以年支查其余地支，
    let Description = '白虎'
    CHEATS = '“寅午戌见子,申子辰见午,亥卯未见酉,巳酉丑见卯'
    this.generateZhiShenSha(Description, CHEATS)
  },
  /**
   * 44.病符
   */
  bingFu: function () {
    //  病符 子见亥,丑见子,寅见丑,卯见寅,辰见卯,巳见辰,午见巳,未见午,申见未,酉见申,戌见酉,亥见戌
    let Description = '病符'
    CHEATS = '子见亥,丑见子,寅见丑,卯见寅,辰见卯,巳见辰,午见巳,未见午,申见未,酉见申,戌见酉,亥见戌'
    this.generateZhiShenSha(Description, CHEATS)
  },
  /**
   * 45.血刃
   */
  xueRen: function () {
    // TODO 血刃
    let Description = '血刃'
  },
  /**
   * 46.阴差阳错
   */
  yinChaYangCuo: function () {
    // 阴差阳错 丙子日、丙午日、丁丑日、丁未日、戊寅日、戊申日；辛卯日、辛酉日、壬辰日、壬戌日、癸巳日、癸亥日。这些日柱就是阴差阳错。
    let Description = '阴差阳错'
    let targetGanZhis = ['丙子', '丙午', '丁丑', '丁未', '戊寅', '戊申', '辛卯', '辛酉', '壬辰', '壬戌', '癸巳', '癸亥']
    let dayGanZhi = this.gz.gans[2] + this.gz.zhis[2]
    if (targetGanZhis.indexOf(dayGanZhi) != -1) {
      this.shenShas[2].push(Description)
    }
  },
  /**
   * 47.八专
   */
  baZhuan: function () {
    // 八专 八专乃甲寅、乙卯、己未、丁未、庚申、辛酉、戊戌、癸丑
    let Description = '八专'
    let targetGanZhis = ['甲寅', '乙卯', '己未', '丁未', '庚申', '辛酉', '戊戌', '癸丑']
    let dayGanZhi = this.gz.gans[2] + this.gz.zhis[2]
    if (targetGanZhis.indexOf(dayGanZhi) != -1) {
      this.shenShas[2].push(Description)
    }
  },
  /**
   * 48.九丑
   */
  jiuChou: function () {
    //  九丑 丁酉日。戊子日。戊午日。己卯日。己酉日。辛卯日。辛酉日。壬子日。壬午日。
    let Description = '九丑'
    let targetGanZhis = ['丁酉', '戊子', '戊午', '己卯', '己酉', '辛卯', '辛酉', '壬子', '壬午']
    let dayGanZhi = this.gz.gans[2] + this.gz.zhis[2]
    if (targetGanZhis.indexOf(dayGanZhi) != -1) {
      this.shenShas[2].push(Description)
    }
  },
  /**
   * 49.五鬼
   */
  wuGui: function () {
    // 五鬼以生月（月支）查其他地支，见者即是：子月出生见辰，丑月出生见巳，寅月出生见午，卯月出生见未，辰月出生见申，巳月出生见酉，午月出生见戌，未月出生见亥，申月出生见子，酉月出生见丑，戌月出生见寅，亥月出生见卯。
    let Description = '五鬼'
    CHEATS = '子见辰,丑见巳,寅见午,卯见未,辰见申,巳见酉,午见戌,未见亥,申见子,酉见丑,戌见寅,亥见卯'
    this.generateZhiShenSha(Description, CHEATS)
  },
  /**
   * 50.天转
   */
  tianZhuan: function () {
    //  天转 天转有四日，分别是春季的乙卯日，夏季的丙午日，秋季的辛酉日，冬季的壬子日。
    let Description = '天转'
    let targetGanZhis = ['乙卯', '丙午', '辛酉', '壬子']
    let dayGanZhi = this.gz.gans[2] + this.gz.zhis[2]
    if (targetGanZhis.indexOf(dayGanZhi) != -1) {
      this.shenShas[2].push(Description)
    }
  },
  /**
   * 51.地转
   */
  diZhuan: function () {
    //  地转 地转也有四日，分别是春季的辛卯日，夏季的戊午日，秋季的癸酉日，冬季的丙子日。
    let Description = '地转'
    let targetGanZhis = ['辛卯', '戊午', '癸酉', '丙子']
    let dayGanZhi = this.gz.gans[2] + this.gz.zhis[2]
    if (targetGanZhis.indexOf(dayGanZhi) != -1) {
      this.shenShas[2].push(Description)
    }
  },
  /**
   * 52.天赦
   */
  tianShe: function () {
    // 天赦 寅卯辰月生戊寅日, 巳午未月生甲午日, 申酉戌月生戊申日, 亥子丑月生甲子日
    let Description = '天赦'
    CHEATS = '月日,寅卯辰见戊寅, 巳午未见甲午, 申酉戌见戊申, 亥子丑见甲子'
    yueZhis = ['寅卯辰', '巳午未', '申酉戌', '亥子丑']
    riGanZhis = ['戊寅', '甲午', '戊申', '甲子']
    yueZhis.map((yueZhi, idx) => {
      if (yueZhi.indexOf(this.gz.zhis[1]) != -1 && this.gz.gans[2] + this.gz.zhis[2] == riGanZhis[idx]) {
        this.shenShas[2].push(Description)
      }
    })
  },
  /**
   * 53.四废
   */
  siFei: function () {
    // 四废 春庚申辛酉，夏壬子癸亥，秋甲寅乙卯，冬丙午丁巳
    // 春庚申，辛酉的意思在月支是寅卯辰的情况下，如果日主是庚申或辛酉，那么命局中就存在四废。夏壬子，癸亥的意思在月支是巳午未的情况下，如果日主是壬子或癸亥，那么命局中就存在四废。秋甲寅，乙卯的意思在月支是申酉戌的情况下，如果日主是甲寅或乙卯，那么命局中就存在四废。冬丙午，丁巳的意思在月支是亥子丑的情况下，如果日主是丙午或丁巳，那么命局中就存在四废。
    let Description = '四废'
    yueZhis = ['寅卯辰', '巳午未', '申酉戌', '亥子丑']
    riGanZhis = [
      ['庚申', '辛酉'],
      ['壬子', '癸亥'],
      ['甲寅', '乙卯'],
      ['丙午', '丁巳']
    ]
    yueZhis.map((yueZhi, idx) => {
      if (yueZhi.indexOf(this.gz.zhis[1]) != -1) {
        riGanZhis.map(riGanZhi => {
          if (this.gz.gans[2] + this.gz.zhis[2] == riGanZhi) {
            this.shenShas[2].push(Description)
          }
        })
      }
    })
  },
  /**
   * 通用的神煞获取法
   * @param {*} Description
   * @param {*} cheats
   * @returns
   */
  generateShenSha: function (Description, cheats) {
    cheatsString = cheats.split(',')

    if (cheatsString.length == 0) {
      return
    }

    starts = []
    for (let i = 0; i < cheatsString[0].length; i++) {
      switch (cheatsString[0][i]) {
        case '年':
          //starts.add(bazi.getYearGan().toString())
          starts.push(this.gz.baziGans[0])
          break
        case '月':
          //   starts.add(bazi.getMonthZhi().toString())
          starts.push(this.gz.baziZhis[1])
          break
        case '日':
          //   starts.add(bazi.getDayGan().toString())
          starts.push(this.gz.baziGans[2])
          break
        case '时':
          //   starts.add(bazi.getHourGan().toString())
          starts.push(this.gz.baziGans[3])
          break
      }
    }

    for (let i = 1; i < cheatsString.length; i++) {
      str = cheatsString[i].split('见')
      for (let j = 0; j < starts.length; j++) {
        // if(str[0].contains(starts.get(j))&&(str[1].contains(diZhi.toString())||str[1].contains(tiangan.toString()))){
        if (str[0].indexOf(starts[j]) != -1) {
          this.gz.gans.map((baziGan, index) => {
            if (str[1].indexOf(baziGan) != -1) {
              this.shenShas[index].push(Description)
            }
          })
          this.gz.zhis.map((baziZhi, index) => {
            if (str[1].indexOf(baziZhi) != -1) {
              this.shenShas[index].push(Description)
            }
          })
        }
      }
    }
  },

  /**
   * 通用的神煞获取法(通过目标查其余地支)
   * @param {*} Description
   * @param {*} cheats
   * @returns
   */
  generateZhiShenSha: function (Description, cheats, targets = [this.gz.baziZhis[0]]) {
    let cheatsString = cheats.split(',')
    if (cheatsString.length == 0) {
      return
    }
    for (let i = 0; i < cheatsString.length; i++) {
      str = cheatsString[i].split('见')
      targets.map(target => {
        if (str[0].indexOf(target) != -1) {
          this.gz.zhis.map((baziZhi, index) => {
            if (str[1].indexOf(baziZhi) != -1) {
              this.shenShas[index].push(Description)
            }
          })
        }
      })
    }
  },
  /**
   * 通用的神煞获取法(通过目标查干支)
   * @param {*} Description
   * @param {*} cheats
   * @returns
   */
  generateGanZhiShenSha: function (Description, cheats, targets = [this.gz.baziZhis[0]]) {
    let cheatsString = cheats.split(',')
    if (cheatsString.length == 0) {
      return
    }
    for (let i = 0; i < cheatsString.length; i++) {
      str = cheatsString[i].split('见')
      targets.map(target => {
        if (str[0].indexOf(target) != -1) {
          this.gz.ganZhis.map((ganZhi, index) => {
            if (str[1].indexOf(ganZhi) != -1) {
              this.shenShas[index].push(Description)
            }
          })
        }
      })
    }
  },
  /**
   *
   * @param {所有天干} gans
   * @param {所有地支} zhis
   */
  getByGanZhi: function (gans, zhis) {
    this.gz.gans = gans
    this.gz.zhis = zhis

    this.gz.baziGans = gans.slice(0, 6) //八字天干
    this.gz.baziZhis = zhis.slice(0, 6) //八字地支

    this.gz.liuGans = gans.slice(6, 12) //流天干
    this.gz.liuZhis = zhis.slice(6, 12) //流地支

    this.gz.ganZhis = []

    gans.map((g, idx) => {
      this.gz.ganZhis.push(g + zhis[idx])
    })
    this.shenShas = []
    for (let i = 0; i < gans.length; i++) this.shenShas.push([])

    // 调用方法
    this.SHEN_SHA_DATA.map(shensha => {
      if (shensha.func) eval(`this.${shensha.func}()`)
    })

    // console.log('gz', this.gz)
    let titles = ['年柱', '月柱', '日柱', '时柱', '分柱', '秒柱', '大运', '流年', '流月', '流日', '流时', '流分', '流秒']
    this.shenShas.map((item, index) => {
      // console.log(titles[index], item)
      // 这里加了去重
      return Array.from(new Set(item))
    })

    return this.shenShas
  }
}

// shenShaUtil.getByGanZhi('辛庚己丁庚丙戊癸戊庚壬辛庚'.split(''), '巳子巳卯子子戌卯午子午丑寅'.split(''))
